Locked-Inc/STAR/star-rx72n-firmware/src/tasks/imu_task.c
  /* Guard against spurious INT edges before event flags are fully created */
  if (!s_imu_event_flags_ready) {
    return;
  }

  /* Signal the IMU task that BNO055 data is ready */
  (void)tx_event_flags_set(&s_imu_event_flags, (ULONG)k_imu_event_data_ready, TX_OR);
}

/**
 * @brief IMU task entry point - initialize sensors then read on BNO055 INT
 *
 * @details
 * Task startup sequence:
 * 1. Feed IWDT heartbeat before the long startup sequence (~1.37 s total)
 * 2. Hardware reset BNO055 via P83 (IMU RST, active-low):
 *    >= 10 ms assert + >= 650 ms POR (with +1 tick slack each)
 * 3. Feed IWDT heartbeat after hardware reset
 * 4. Initialize BNO055 via rx_bno055_init() (~700 ms for software reset + config)
 *    (skipped if hardware reset failed)
 * 5. Feed IWDT heartbeat after BNO055 init
 * 6. Initialize BMP280 via rx_bmp280_init() (~2 ms for calib read)
 * 7. Enter interrupt-driven loop:
 *    a. Feed IWDT heartbeat FIRST (must precede any blocking sensor re-init)
 *    b. Block on BNO055 INT event flag (200 ms watchdog timeout)
 *    c. Retry init for any sensor that failed startup (until success)
 *    d. internal_read_and_publish_imu() if bno_ready - BNO055 -> shared_data_update_imu()
 *    e. internal_read_and_publish_baro() if bmp_ready - BMP280 -> shared_data_update_baro()
 *
 * Both sensors are initialized before the poll loop. If either init fails,
 * the loop retries init each iteration until both succeed. Reads are only
 * performed once the corresponding sensor is ready. Shared state valid flags
 * remain false until sensor init and the first read both succeed.
 *
 * @param[in] input Unused thread entry parameter (ULONG, always 0)
 *
 * @pre ThreadX scheduler running
 * @pre s_imu_created == true (imu_task_create() completed)
 * @pre "i2c1_imu" bus registered in g_bus_manager (registered by main.c)
 * @pre RIIC1 initialized at 400 kHz (by hardware_init.c i2c_init)
 * @pre shared_data_init() completed (imu_mutex and baro_mutex available)
 * @pre BNO055 powered on RIIC1 I2C bus, RST pin (P83) configured as GPIO output
 * @pre BMP280 powered on RIIC1 I2C bus
 *
 * @post imu_state_t updated via shared_data_update_imu() on each BNO055 INT
 * @post baro_state_t updated via shared_data_update_baro() on each BNO055 INT
 * @post State valid flags remain false until first successful sensor read
 * @post IWDT heartbeat fed on each loop iteration (< 200 ms period)
 *
 * @note Not thread-safe; runs as single dedicated ThreadX task
 * @note Sensor init failures do not halt the task; valid flag stays false
 * @note BNO055 hardware reset (~670 ms) + software init (~700 ms) block at startup only; IWDT fed between each
 * @note Does not preempt motor control (priority 8) or obstacle detect (12)
 *
 * @warning Do not call directly; use imu_task_create() to register with ThreadX
 *
 * @see imu_task_create() Creates this task
 * @see INT_IRQ12() ISR that signals the event flags
 * @see internal_read_and_publish_imu() BNO055 read and publish helper
 * @see internal_read_and_publish_baro() BMP280 read and publish helper
 * @see internal_imu_hardware_reset() Hardware reset helper (step 1)
 * @see rx_bno055_init() BNO055 initialization
 * @see rx_bmp280_init() BMP280 initialization
 *
 * @since Version 1.0.0
 */
static void internal_imu_task_entry(ULONG input)
{
  (void)input;

  RX_ASSERT(s_imu_created, "IMU task entry called before task created");
  RX_ASSERT(s_tag != NULL, "s_tag must not be NULL");

  rx_log_info(s_tag, "IMU task starting - initializing sensors");

  /* Feed watchdog before the long startup sequence (~1.37 s total) so the IWDT
   * registration window is refreshed and the system does not reset during init. */
  internal_send_iwdt_heartbeat();

  /* Step 1: Hardware reset BNO055 via P83 (IMU RST, active-low) to guarantee clean state.
   * Asserts RST LOW for >= 10 ms then releases; waits >= 650 ms for POR to complete. */
  bool           bno_ready = false;
  const rx_err_t err_rst   = internal_imu_hardware_reset();
  if (err_rst != k_rx_ok) {
    rx_log_error_val(s_tag, "BNO055 HW reset failed - will skip init", (uint32_t)err_rst);
  }

  /* Feed watchdog after the hardware reset block (~670 ms) before BNO055 software
   * init (~700 ms) to prevent IWDT expiry during the combined ~1.37 s startup. */
  internal_send_iwdt_heartbeat();

  /* Step 2: Initialize BNO055 (software reset + config, blocks ~700 ms) */
  if (err_rst == k_rx_ok) {
    const bno055_config_t bno_cfg = {.mode = k_bno055_mode_interrupt};
    const rx_err_t        err_bno = rx_bno055_init(&g_bus_manager, &bno_cfg);
    if (err_bno != k_rx_ok) {
      rx_log_error_val(s_tag, "BNO055 init failed - will retry in loop", (uint32_t)err_bno);
    } else {
      bno_ready = true;
      rx_log_info(s_tag, "BNO055 initialized in NDOF mode");
    }
  }

  /* Feed watchdog after BNO055 init before BMP280 init */
  internal_send_iwdt_heartbeat();

  /* Step 3: Initialize BMP280 (~2 ms for calibration burst read) */
  bool           bmp_ready = false;
  const rx_err_t err_bmp   = rx_bmp280_init(&g_bus_manager);
  if (err_bmp != k_rx_ok) {
    rx_log_error_val(s_tag, "BMP280 init failed - will retry in loop", (uint32_t)err_bmp);
  } else {
    bmp_ready = true;
    rx_log_info(s_tag, "BMP280 initialized in forced mode");
  }

  /* Step 4: Interrupt-driven loop - block on BNO055 INT event flag */
  rx_log_info(s_tag, "IMU interrupt-driven mode: blocking on IRQ12 event flag");
  while (1) {
    /* Feed IWDT heartbeat first -- must arrive within 900 ms window */
    internal_send_iwdt_heartbeat();

    /* Block until BNO055 asserts INT (falling edge) or 200 ms timeout */
    (void)internal_wait_for_imu_int();

    /* Retry init for sensors that failed initial startup */
    internal_retry_sensor_init(&bno_ready, &bmp_ready);

    if (bno_ready) {
      internal_read_and_publish_imu();
    }
    if (bmp_ready) {
      internal_read_and_publish_baro();
    }
  }
}
